[
  {
    "_id": "63e4f47527da6b55271ab610",
    "name": "Raw Banana and Banana Stem Stuffed Paratha Recipe",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/Raw_Banana_and_Banana_Stem_Stuffed_Paratha_Recipe.jpg",
    "description": "Raw Banana and Banana Stem Stuffed Paratha Recipe is a super healthy stuffed Indian bread that contains two ingredients that have a good nutritional value. Parathas are a staple breakfast for most of the North Indian people. It is usually made with Aloo, onion or paneer as a stuffing. But it is very rare to use raw banana and raw stem in a stuffed paratha, here in this recipe we have put them together in one dish that is made super delicious and can be had without any guilt as your morning breakfast.",
    "cuisine": "Indian",
    "course": "Lunch",
    "diet": "Diabetic Friendly",
    "prep_time": "Total in 50 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t1 Banana Stem\t\t\t\t\t\t\t \t\t, cut into small pieces\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 Raw Banana\t\t\t\t\t\t\t \t\t, boiled and mashed\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 Onion\t\t\t\t\t\t\t \t\t, chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t4 cloves Garlic\t\t\t\t\t\t\t \t\t, chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 inch Ginger\t\t\t\t\t\t\t \t\t, chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 Green Chilli\t\t\t\t\t\t\t \t\t, chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 teaspoon Cumin seeds (Jeera) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Red Chilli powder \n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Turmeric powder (Haldi) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Garam masala powder \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Black pepper powder \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Amchur (Dry Mango Powder) \n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\nFor the Dough\n\n\t\t\t\t\t\t\t \t\t1 cup Whole Wheat Flour \n",
    "instructions": "To begin making the by boiling the raw banana in the pressure cooker. Cut the banana into two pieces, remove the edges, boil it with water and salt for about 4 whistle.Once done, release the pressure naturally, remove the skin and mash it into a fine mixture.Heat a saucepan with oil, add cumin seeds and allow it splutter for 10 seconds. Add chopped onions, garlic, ginger and saute until it softens.Add the chopped banana stem along with ½ cup water and cover it with a lid and cook for about 15 minutes until the banana stem is cooked.To this add all the spice powder like turmeric powder, red chilli powder, garma masala, amchur powder, salt and pepper powder and also add the mashed raw banana.Mix well and cook the mixture for about 10 more minutes on low heat and switch it off.In order to make the dough, knead all the ingredients well into a soft dough .Now to begin making the paratha, keep some flour aside for dusting. Divide the dough into large lemon side balls.Dust the dough portions in flour, flatten it and roll it into a 3 inch diameter circle. Place the filling on half side of the circle and close the paratha by folding it from all sides. Yes it’s as simple as that.You will have a big dumpling.Press it slightly and gently use the rolling pin to flatten it. Take care, the filling can ooze out if the dough is rolled out too thin.Now to cook the Paratha, first preheat the skillet on medium heat. Place the rolled paratha on top and allow it to cook on one side. After about 10 to 15 seconds, flip the paratha.At this stage, smear some oil or ghee to cook the paratha. Cook the paratha by flipping over a couple of times until you see golden brown spots on both sides.Serve the Raw Banana and Banana Stem Stuffed Paratha along with fresh cup of curd by the side or Aam Ka Chunda Recipe to go along with your paratha."
  },
  {
    "_id": "63e4f47627da6b55271aba7f",
    "name": "Vazhaithandu Pachadi Recipe - Banana Stem Raita",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/Indian_Raitas/Vazhaithandu_Banana_Stem_Raita_Recipe-3-2.jpg",
    "description": "The Vazhaithandu Pachadi - Banana Stem Raita is a healthy recipe with the Banana Stem added raw to the yogurt and seasoned with mustard seeds. Banana Stem is known as Vazhaithandu in Tamil and is a super nutritious root to have. The Vazhaithandu is rich is fiber and nutrients and when combined with yogurt is great for stomach ailments.",
    "cuisine": "Indian",
    "course": "Side Dish",
    "diet": "Vegetarian",
    "prep_time": "Total in 30 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t1 cup Banana Stem\t\t\t\t\t\t\t \t\t, cut into small dices (with outer thick skin removed)\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 cups Curd (Dahi / Yogurt)\t\t\t\t\t\t\t \t\t, whisked\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 or 2 Green Chillies \n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Mustard seeds (Rai/ Kadugu) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon White Urad Dal (Split) \n\n\t\t\t\t\t\t\t \t\t1 sprig Curry leaves\t\t\t\t\t\t\t \t\t, finely chopped\t\t\t\t\t\t\t \t\n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n\nOil\t\t\t\t\t\t\t \t\t, for seasoning\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making the Vazhaithandu Pachadi Recipe, we will first whisk the yogurt with salt.Add in the diced banana stem in to the whisked yogurt and keep aside.Heat 1/2 a teaspoon of oil in a small pan; add in the mustard seeds and split white urad dal. Allow the seeds to crackle and saute till the dal turns brown. Once done add in the green chillies and curry leaves and stir for a few secondsAdd the seasoning into the Vazhaithandu Yogurt mixture and give it a good stir. Check for salt levels and adjust to suit your taste.The Vazhaithandu Pachadi is now ready to be served. Serve the Vazhaithandu Pachadi along with Steamed Rice and Mixed Vegetable Sambar  and for a weekday meal."
  },
  {
    "_id": "63e4f47a27da6b55271ac029",
    "name": "Raw Banana Dosa Recipe ",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/Raw_Banana_Dosa_Recipe_.jpg",
    "description": "Raw Banana Dosa Recipe is an innovative way by adding a vegetable into your everyday dosa batter to make it healthy. By adding the Banana Plantain into your dosa batter you will get a soft and fluffy dosa texture that can be had with any kind of chutney.",
    "cuisine": "Indian",
    "course": "South Indian Breakfast",
    "diet": "Vegetarian",
    "prep_time": "Total in 40 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t2 cups Idli Dosa Batter \n\n\t\t\t\t\t\t\t \t\t1 Raw Banana\t\t\t\t\t\t\t \t\t, boiled and cut into small pieces\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1/2 cup Fresh coconut \n\n\t\t\t\t\t\t\t \t\t1/4 teaspoon Turmeric powder (Haldi) \n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making the Raw Banana Dosa Recipe, make the dosa batter ready by following the recipe link.Pressure cook the raw banana with water and turmeric powder for about 4 whistles until it becomes soft, remove the skin and chop them into small pieces.Grind the raw banana along with coconut by adding little water to a smooth paste.Add the paste to the dosa batter and mix well.Check the salt levels and adjust to suit your taste.Heat a skillet on high heat; Pour a ladleful of batter in the center and hold the ladle and spread the batter to form an uttapam.Drizzle about a teaspoon of oil around the edges and towards the insides.Cook the dosa on both sides, until you noticed it has browned a little and has slightly crispy edges.To make it extra crispy, cook the dosa on a medium heat and preferably on an iron skillet. Iron skillets maintain heat and brings out a perfect texture to the dosa.Serve the Raw Banana Dosa Recipe along with south Indian Chutney or a Tomato onion chutney recipe to enjoy your breakfast."
  },
  {
    "_id": "63e4f47527da6b55271ab7d2",
    "name": "Methi Aur Kache Kele Ki Sabzi Recipe-Fenugreek Greens & Raw Banana Stir Fry",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/nithya.anantham/Methi_Kache_Kele_Ki_Sabzi_Recipe.jpg",
    "description": "Methi Aur Kache Kele Ki Sabzi Recipe is a stir fry recipe made from Fenugreek Greens & Raw Banana. These main ingredients are sauteed in a tadka of onions, tomatoes, ginger garlic paste and then combined with simple spices like red chilli powder, coriander powder, turmeric powder.",
    "cuisine": "Indian",
    "course": "Side Dish",
    "diet": "Vegetarian",
    "prep_time": "Total in 25 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t3 Raw Banana\t\t\t\t\t\t\t \t\t, cut into cubes\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 cup Methi Leaves (Fenugreek Leaves)\t\t\t\t\t\t\t \t\t, roughly chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 Onion\t\t\t\t\t\t\t \t\t, finely chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 Tomato\t\t\t\t\t\t\t \t\t, finely chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 tablespoon Ginger Garlic Paste \n\n\t\t\t\t\t\t\t \t\t1 Green Chilli\t\t\t\t\t\t\t \t\t, finely chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 teaspoon Cumin seeds (Jeera) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Red Chilli powder \n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Turmeric powder (Haldi) \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Coriander Powder (Dhania) \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Oil \n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making Methi Kache Kele Ki Sabzi Recipe, peel the skin of the plantains, chop them into cubes and place them in a bowl of water until further cooking. This step is to avoid oxidation and the raw bananas from turning brownish.Heat oil in a kadai, add the cumin seeds and let them splutter.Once they splutter, add the onions and saute till the onions turn translucent.Add the ginger garlic paste and saute for about a minute on low medium heat or till the raw smell vanishes.Once the ginger garlic are cooked thoroughly, add the tomatoes and green chillies, saute until the tomatoes turn mushy.Now add in the fenugreek leaves, red chilli powder, coriander powder and turmeric powder (haldi) and mix well.Let the fenugreek leaves wilt a bit; once they do, drain all the water from the raw bananas and add them to the kadai/pan. You can add a bit of water as well, to help them cook evenly and without sticking to the kadai.Season with salt and mix everything well. Cover and cook the Methi Kache Kele Ki Sabzi . This will take around 10 minutes on medium heat.Once the plantains are cooked, saute Methi Kache Kele Ki Sabzi till the water dry out. Switch off the heat.Serve Methi Aur Kache Kele Ki Sabzi Recipe (Fenugreek Greens & Raw Banana Stir Fry) along with Lobia Masala, Tawa Paratha and Carrot Cucumber Tomato Salad."
  },
  {
    "_id": "63e4f47627da6b55271abb83",
    "name": "Ajwaini Kache Kele Ki Sabzi Recipe -Plantains Cooked With Caraway Seeds",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/nithya.anantham/Ajwaini_Kache_Kele_Ki_Sabzi_Recipe_Plantains_cooked_with_Caraway_Seeds.jpg",
    "description": "Ajwaini Kache Kele Ki Sabzi Recipe is a delicious dish prepared using raw banana's or plantains spiced with the caraway seeds. Amchur powder adds a slight tanginess to the dish. The addition of caraway seeds to the plantains, aids in better digestion. The plantains are cooked in simple spices adding flavour and delicious taste. This sabzi is cooked without onion and garlic, therefore you can also make it during your fasting days.",
    "cuisine": "Indian",
    "course": "Side Dish",
    "diet": "Vegetarian",
    "prep_time": "Total in 30 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t3 Raw Banana\t\t\t\t\t\t\t \t\t, cut into small cubes\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 teaspoon Cumin seeds (Jeera) \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Ajwain (Carom seeds) \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Coriander Powder (Dhania) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Red Chilli powder \n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Turmeric powder (Haldi) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Amchur (Dry Mango Powder) \n\n\t\t\t\t\t\t\t \t\t3 teaspoons Oil \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Coriander (Dhania) Leaves\t\t\t\t\t\t\t \t\t, finely chopped for garnish\t\t\t\t\t\t\t \t\n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making Ajwaini Kache Kele Ki Sabzi Recipe, peel the outer covering of the raw bananas, chop them into cubes and place them in a bowl of water until further use, to avoid the discolouration.Heat oil in a heavy bottomed pan, add the cumin seeds and let it splutter. Slightly crush the caraway seeds between your palms and add it to the oil to flavour it.Drain the raw banana cubes from water and add it to the pan and mix well. Add the coriander powder, turmeric powder, red chilli powder, season with salt and mix well.Let the raw banana cook to 3/4th with the lid closed. Now, keep sauteeing the plantains until they are well cooked and turns crispy on the outside. This will take around 5 minutes.Add in the amchur powder, coriander leaves, mix  the Ajwaini Kache Kele Ki Sabzi well and switch off the heat. Remove Ajwaini Kache Kele Ki Sabzi into a serving bowl.Serve the Ajwaini Kache Kele Ki Sabzi Recipe along with Phulka and Dal Palak for the weekday lunch."
  },
  {
    "_id": "63e4f47527da6b55271ab724",
    "name": "Chicken Cooked in Banana Leaves Recipe",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/garimasgautam-gmail.com/Chicken_Cooked_in_Banana_Leaves_original1.jpg",
    "description": "Long marination makes the chicken tender and succulent in this Chicken Cooked in Banana Leaves Recipe.",
    "cuisine": "Indian",
    "course": "Appetizer",
    "diet": "High Protein Non Vegetarian",
    "prep_time": "Total in 95 M",
    "ingredients": "\n\n\t\t\t\t\t\t\t \t\t500 grams Boneless chicken\t\t\t\t\t\t\t \t\t, 2 inch cubes\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1 Lemon \n\n\t\t\t\t\t\t\t \t\t2 Green Chillies \n\n\t\t\t\t\t\t\t \t\t10 sprig Coriander (Dhania) Leaves \n\n\t\t\t\t\t\t\t \t\t2 tablespoons Ginger Garlic Paste \n\n\t\t\t\t\t\t\t \t\t10 Whole Black Peppercorns \n\n\t\t\t\t\t\t\t \t\t3 Star anise \n\n\t\t\t\t\t\t\t \t\t5 Cloves (Laung) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Red Chilli powder \n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Turmeric powder (Haldi) \n\n\t\t\t\t\t\t\t \t\t2 Banana leaf \n\nCotton threads\t\t\t\t\t\t\t \t\t, as required\t\t\t\t\t\t\t \t\n\nOil\t\t\t\t\t\t\t \t\t, as required\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making the Chicken Cooked in Banana Leaves, in a mixer-jar, combine the green chillies, coriander sprigs (stem as well), ginger garlic paste, cloves, peppercorns, star anise and grind to a coarse mixture. In a mixing bowl, add the chicken, the freshly ground mixture, lime juice, red chili powder, turmeric powder, salt. Make sure the chicken pieces are completely coated with the mixture. Let the chicken pieces marinate for two hours.Once the chicken is marinated, cut the banana leaves into squares of 4 inch squares, so that you can make parcels. Now put the one chicken piece in one banana leaf piece.Fold the leaf to make a parcel and tie it using a thread.Heat oil in a pan, add the parcels into the pan and make sure you are not crowding the pan. Cover the pan and cook the parcels from both sides for at-least 15-20 minutes.Open the parcels and serve hot. Serve Chicken Cooked in Banana Leaves as an appetizer along with other appetizers such as Mushroom Poha Cutlets Recipe and Easy Sabudana Vada With Arrowroot Powder."
  },
  {
    "_id": "63e4f47a27da6b55271ac088",
    "name": "Mooli Aur Kaccha Kela Kofta Recipe (Grated Radish And Raw Banana Dumplings In Gravy)",
    "image_url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/nithya.anantham/Mooli_Raw_Banana_Kofta_Recipe.jpg",
    "description": "Kofta's are a delicious recipe that everybody prefers to cook on a special day or when we have to treat our guests. This Mooli Aur Kaccha Kela Kofta Recipe (Grated Radish And Raw Banana Dumplings In Tomato Gravy) is simple and nutritious. The delectable Raw Banana and Mooli Kofta's are not fried but shallow fried using a Paniyaram Pan, making it a healthy choice. They are then dunked in a healthy yet rich yogurt and tomato based gravy, making the whole dish lower in calories. You can make the Kofta gravy richer by adding cream at the end but we have excluded it keeping it simple yet nutritious. Serve the Mooli Aur Kaccha Kela Kofta Recipe (Grated Radish And Raw Banana Dumplings In Tomato Gravy) along with Whole Wheat Soya Keema Kulchas, and Spiced Kumbh Pulao Recipe (Spicy Mushroom Rice) with Tomato Onion Cucumber Raita Recipe for an elaborate weekend lunch for your guests or family at home.",
    "cuisine": "Indian",
    "course": "Side Dish",
    "diet": "Vegetarian",
    "prep_time": "Total in 50 M",
    "ingredients": "\nIngredients to make the kofta's\n\n\t\t\t\t\t\t\t \t\t2 Raw Banana\t\t\t\t\t\t\t \t\t, steamed\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t3 Mooli/ Mullangi (Radish)\t\t\t\t\t\t\t \t\t, grated\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 Green Chillies\t\t\t\t\t\t\t \t\t, finely chopped\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 teaspoons Ginger\t\t\t\t\t\t\t \t\t, grated\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1/3 cup Gram flour (besan)\t\t\t\t\t\t\t \t\t, dry roasted\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t1/4 teaspoon Ajwain (Carom seeds) \n\n\t\t\t\t\t\t\t \t\t1/2 teaspoon Red Chilli powder \n\nOil\t\t\t\t\t\t\t \t\t, to cook koftas\t\t\t\t\t\t\t \t\n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\nIngredients for making the gravy\n\n\t\t\t\t\t\t\t \t\t2 Onions\t\t\t\t\t\t\t \t\t, ground to a paste\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 Tomatoes\t\t\t\t\t\t\t \t\t, pureed\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 tablespoons Ginger Garlic Paste \n\n\t\t\t\t\t\t\t \t\t1 Green Chilli\t\t\t\t\t\t\t \t\t, slit\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t4 tablespoons Curd (Dahi / Yogurt) \n\n\t\t\t\t\t\t\t \t\t7 Cashew nuts\t\t\t\t\t\t\t \t\t, ground to a paste\t\t\t\t\t\t\t \t\n\n\t\t\t\t\t\t\t \t\t2 teaspoons Kashmiri Red Chilli Powder \n\n\t\t\t\t\t\t\t \t\t2 teaspoon Coriander Powder (Dhania) \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Garam masala powder \n\n\t\t\t\t\t\t\t \t\t1 teaspoon Cumin seeds (Jeera) \n\n\t\t\t\t\t\t\t \t\t1 Bay leaf (tej patta) \n\n\t\t\t\t\t\t\t \t\t2 Cardamom (Elaichi) Pods/Seeds \n\n\t\t\t\t\t\t\t \t\t1 tablespoon Oil \n\n\t\t\t\t\t\t\t \t\t2 teaspoons Coriander (Dhania) Leaves\t\t\t\t\t\t\t \t\t, finely chopped for garnish\t\t\t\t\t\t\t \t\n\nSalt\t\t\t\t\t\t\t \t\t, to taste\t\t\t\t\t\t\t \t\n",
    "instructions": "To begin making Mooli Aur Kaccha Kela Kofta Recipe, steam the raw banana's in a steamer or pressure cook for one whistle, peel the cover, mash and keep aside.Next grate the radishes, sprinkle some salt over and leave it to release all its water, squeeze and keep aside.Also, prep the onion paste, tomato puree and cashew paste one by one using a mixer grinder and keep aside until you begin to cook the gravy.Now, to make the kofta mix together the mashed raw banana, grated radish, roasted besan, green chilli, grated ginger, red chilli powder, caraway seeds, season with salt in a big bowl. Make small kofta's and keep it ready to fry using a paniyaram pan.Now, heat the paniyaram pan, brush it with little oil, place the kofta's in each cavity and let it roast on the bottom.Once the bottom is cooked, flip over and cook the other side, apply a little oil if required and keep aside.Like wise, prepare the rest of the kofta'sTo make the gravy, heat oil in a pan, add the bay leaf, cardamom and let it release its flavour into the oil.Add the onion paste and saute until it turns golden brown.Add the ginger and garlic paste and cook until the raw smell goes away.Add the tomato puree, slit green chilli, kashmiri red chilli, coriander, garam masala and cook until the oil seperates out.Now, whisk together the yoghurt and cashew paste using little water to a smooth consistency and add it to the pan.Add 2 cups of water or to your desired consistency, season with salt and let th gravy simmer for 10 minutes.Once the gravy comes together, gently drop the prepared kofta's in and simmer for another 5 minutes.Turn off the heat and garnish with coriander leaves.Serve the Mooli Aur Kaccha Kela Kofta Recipe (Grated Radish And Raw Banana Dumplings In Tomato Gravy) along with Whole Wheat Soya Keema Kulchas, and Spiced Kumbh Pulao Recipe (Spicy Mushroom Rice) with Tomato Onion Cucumber Raita Recipe for an elaborate weekend lunch for your guests or family at home."
  }
]
